CSI API ETABS v1
cDesignCompositeBeam.GetDesignSection Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDesignSection(
	string Name,
	ref string PropName
)
Function GetDesignSection (
	Name As String,
	ByRef PropName As String
) As Integer
Dim instance As cDesignCompositeBeam
Dim Name As String
Dim PropName As String
Dim returnValue As Integer
returnValue = instance.GetDesignSection(Name,
	PropName)
int GetDesignSection(
	String^ Name,
	String^% PropName
)
abstract GetDesignSection :
        Name : string *
        PropName : string byref -> int
Parameters
Name
Type: System.String
PropName
Type: System.String
Return Value
Type: Int32
See Also
Reference
cDesignCompositeBeam Interface
ETABSv1 Namespace